In [6]:
import pandas as pd
import pymysql

In [7]:
from sqlalchemy import create_engine

In [8]:
connection = "mysql+pymysql://root:Root%401234@localhost:3306/etlqalabs"

In [9]:
df = pd.read_sql("select * from customers",connection)

In [10]:
df

   cid    cname       city
0    1   prabhu      gadag
1    2     guru      blore
2    3    shivu  davangere
3    4  shreyas      gadag
4    5    manta    chicago